aethaniel/emBlocks_sam_patch/share/em_armgcc/lib/atmel/atsam3/atsam3u/include/component/component_smc.h
/* ---------------------------------------------------------------------------- */
/*                  Atmel Microcontroller Software Support                      */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2013, Atmel Corporation                                        */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Atmel's name may not be used to endorse or promote products derived from     */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   */
/* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF */
/* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   */
/* DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      */
/* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT */
/* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  */
/* OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    */
/* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         */
/* NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, */
/* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           */
/* ---------------------------------------------------------------------------- */

#ifndef _SAM3U_SMC_COMPONENT_
#define _SAM3U_SMC_COMPONENT_

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR Static Memory Controller */
/* ============================================================================= */
/** \addtogroup SAM3U_SMC Static Memory Controller */
/*@{*/

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SmcCs_number hardware registers */
typedef struct {
  __IO uint32_t SMC_SETUP;   /**< \brief (SmcCs_number Offset: 0x0) SMC Setup Register */
  __IO uint32_t SMC_PULSE;   /**< \brief (SmcCs_number Offset: 0x4) SMC Pulse Register */
  __IO uint32_t SMC_CYCLE;   /**< \brief (SmcCs_number Offset: 0x8) SMC Cycle Register */
  __IO uint32_t SMC_TIMINGS; /**< \brief (SmcCs_number Offset: 0xC) SMC Timings Register */
  __IO uint32_t SMC_MODE;    /**< \brief (SmcCs_number Offset: 0x10) SMC Mode Register */
} SmcCs_number;
/** \brief Smc hardware registers */
#define SMCCS_NUMBER_NUMBER 4
typedef struct {
  __IO uint32_t     SMC_CFG;                            /**< \brief (Smc Offset: 0x000) SMC NFC Configuration Register */
  __O  uint32_t     SMC_CTRL;                           /**< \brief (Smc Offset: 0x004) SMC NFC Control Register */
  __I  uint32_t     SMC_SR;                             /**< \brief (Smc Offset: 0x008) SMC NFC Status Register */
  __O  uint32_t     SMC_IER;                            /**< \brief (Smc Offset: 0x00C) SMC NFC Interrupt Enable Register */
  __O  uint32_t     SMC_IDR;                            /**< \brief (Smc Offset: 0x010) SMC NFC Interrupt Disable Register */
  __I  uint32_t     SMC_IMR;                            /**< \brief (Smc Offset: 0x014) SMC NFC Interrupt Mask Register */
  __IO uint32_t     SMC_ADDR;                           /**< \brief (Smc Offset: 0x018) SMC NFC Address Cycle Zero Register */
  __IO uint32_t     SMC_BANK;                           /**< \brief (Smc Offset: 0x01C) SMC Bank Address Register */
  __O  uint32_t     SMC_ECC_CTRL;                       /**< \brief (Smc Offset: 0x020) SMC ECC Control Register */
  __IO uint32_t     SMC_ECC_MD;                         /**< \brief (Smc Offset: 0x024) SMC ECC Mode Register */
  __I  uint32_t     SMC_ECC_SR1;                        /**< \brief (Smc Offset: 0x028) SMC ECC Status 1 Register */
  __I  uint32_t     SMC_ECC_PR0;                        /**< \brief (Smc Offset: 0x02C) SMC ECC Parity 0 Register */
  __I  uint32_t     SMC_ECC_PR1;                        /**< \brief (Smc Offset: 0x030) SMC ECC parity 1 Register */
  __I  uint32_t     SMC_ECC_SR2;                        /**< \brief (Smc Offset: 0x034) SMC ECC status 2 Register */
  __I  uint32_t     SMC_ECC_PR2;                        /**< \brief (Smc Offset: 0x038) SMC ECC parity 2 Register */
  __I  uint32_t     SMC_ECC_PR3;                        /**< \brief (Smc Offset: 0x03C) SMC ECC parity 3 Register */
  __I  uint32_t     SMC_ECC_PR4;                        /**< \brief (Smc Offset: 0x040) SMC ECC parity 4 Register */
  __I  uint32_t     SMC_ECC_PR5;                        /**< \brief (Smc Offset: 0x044) SMC ECC parity 5 Register */
  __I  uint32_t     SMC_ECC_PR6;                        /**< \brief (Smc Offset: 0x048) SMC ECC parity 6 Register */
  __I  uint32_t     SMC_ECC_PR7;                        /**< \brief (Smc Offset: 0x04C) SMC ECC parity 7 Register */
  __I  uint32_t     SMC_ECC_PR8;                        /**< \brief (Smc Offset: 0x050) SMC ECC parity 8 Register */
  __I  uint32_t     SMC_ECC_PR9;                        /**< \brief (Smc Offset: 0x054) SMC ECC parity 9 Register */
  __I  uint32_t     SMC_ECC_PR10;                       /**< \brief (Smc Offset: 0x058) SMC ECC parity 10 Register */
  __I  uint32_t     SMC_ECC_PR11;                       /**< \brief (Smc Offset: 0x05C) SMC ECC parity 11 Register */
  __I  uint32_t     SMC_ECC_PR12;                       /**< \brief (Smc Offset: 0x060) SMC ECC parity 12 Register */
  __I  uint32_t     SMC_ECC_PR13;                       /**< \brief (Smc Offset: 0x064) SMC ECC parity 13 Register */
  __I  uint32_t     SMC_ECC_PR14;                       /**< \brief (Smc Offset: 0x068) SMC ECC parity 14 Register */
  __I  uint32_t     SMC_ECC_PR15;                       /**< \brief (Smc Offset: 0x06C) SMC ECC parity 15 Register */
       SmcCs_number SMC_CS_NUMBER[SMCCS_NUMBER_NUMBER]; /**< \brief (Smc Offset: 0x70) CS_number = 0 .. 3 */
  __I  uint32_t     Reserved1[20];
  __IO uint32_t     SMC_OCMS;                           /**< \brief (Smc Offset: 0x110) SMC OCMS Register */
  __O  uint32_t     SMC_KEY1;                           /**< \brief (Smc Offset: 0x114) SMC OCMS KEY1 Register */
  __O  uint32_t     SMC_KEY2;                           /**< \brief (Smc Offset: 0x118) SMC OCMS KEY2 Register */
  __I  uint32_t     Reserved2[50];
  __O  uint32_t     SMC_WPCR;                           /**< \brief (Smc Offset: 0x1E4) Write Protection Control Register */
  __I  uint32_t     SMC_WPSR;                           /**< \brief (Smc Offset: 0x1E8) Write Protection Status Register */
} Smc;
